#===================================================
# Extra repositories
#===================================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "zero-sh/tap"

#===================================================
# Apple Store
#===================================================
brew "mas"                  # Mac App Store command-line interface
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "Slack", id: 803453959

#===================================================
# Drivers
#===================================================
cask "logitech-options"     # Software for Logitech devices

#===================================================
# Shells
#===================================================
brew "bash"                 # Bourne-Again Shell, a UNIX command interpreter
brew "zsh"                  # Z shell, a UNIX command interpreter

#===================================================
# Core shell utilities
#===================================================
brew "gnupg"                # GNU Pretty Good Privacy (PGP) package
brew "neovim"               # Ambitious Vim-fork focused on extensibility and agility
brew "editorconfig"         # Maintain consistent coding style between multiple editors
brew "gettext"              # GNU internationalization (i18n) and localization (l10n) library
brew "less"                 # Pager program similar to more
brew "bat"                  # Clone of cat(1) with syntax highlighting and Git integration
brew "exa"                  # Modern replacement for 'ls'
brew "fd"                   # Simple, fast and user-friendly alternative to find
brew "ripgrep"              # Search tool like grep and The Silver Searcher
brew "jq"                   # Lightweight and flexible command-line JSON processor
brew "rsync"                # Utility that provides fast incremental file transfer
brew "dog"                  # Command-line DNS clinent
brew "httpie"               # User-friendly cURL for API era
brew "wget"                 # Internet file retriever

#===================================================
# Source control
#===================================================
brew "git"                  # Distributed revision control system
brew "git-delta"            # Syntax highlighting pager for git and diff output
brew "git-flow"             # Extensions to follow Vincent Driessen's branching model
brew "git-lfs"              # Git extension for versioning large files

#===================================================
# Programming languages
#===================================================
brew "go"                   # Golang
brew "jenv"                 # Java version management
brew "pyenv"                # Python version management
brew "pyenv-virtualenv"     # Pyenv plugin to manage virtualenv
brew "shellcheck"           # Static analysis and lint tool, for (ba)sh scripts

#===================================================
# Virtualization
#===================================================
brew "ctop"                 # Top-like interface for container metrics
cask "docker"               # Build and share containerized applications
cask "parallels"            # Parallels Desktop
cask "vagrant"              # Reusable development environment
cask "vagrant-manager"      # Manager for Vagrant machines

#===================================================
# Amazon Web Services
#===================================================
brew "awscli"               # Official Amazon AWS command-line interface
cask "aws-vault"            # Amazon AWS IAM password manager

#===================================================
# Kubernetes
#===================================================
brew "minikube"             # Run a Kubernetes cluster locally
brew "helm"                 # Kubernetes package manager
brew "kubernetes-cli"       # Kubernetes command-line interface
brew "openshift-cli"        # OpenShift command-line interface tools

#===================================================
# Infrastructure tools
#===================================================
brew "packer"               # Tool for creating identical machine images for multiple platforms
brew "vault"                # Secures, stores and tightly controls access to secrets
brew "terraform"            # Tool to build, change, and version infrastructure
brew "terragrunt"           # Tool to make Terraform configurations DRY

#===================================================
# Desktop applications
#===================================================
cask "1password"            # Password manager
cask "authy"                # Two-factor authentication software
cask "cheatsheet"           # Tool to list all application shortcuts
cask "cleanmymac"           # Tool to remove unnecessary garbage from macOS
cask "forklift"             # Finder replacement and FTP/S, WebDAV and AWS S3 client
cask "gitkraken"            # UI Git client focusing on productivity
cask "glance"               # Utility that provides quick look previews for files
cask "google-chrome"        # Web browser from Google
cask "iterm2"               # Better terminal emulator
cask "macfuse"              # Integration with additional file systems
cask "visual-studio-code"   # Open-source Code editor
cask "zoom"                 # Video communication and virtual meeting platform
