#===================================================
# Homebrew arguments
#===================================================
cask_args "no-quarantine": true

#===================================================
# Extra repositories
#===================================================
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "hpedrorodrigues/tools"
tap "zero-sh/tap"

#===================================================
# Apple Store
#===================================================
brew "mas"                  # Mac App Store command-line interface
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Slack", id: 803453959

#===================================================
# OSX utilities & drivers
#===================================================
cask "dockutil"             # Tool for managing dock items
cask "font-fira-code"       # Fira Code font
cask "logitech-options"     # Software for Logitech devices

#===================================================
# Shells
#===================================================
brew "bash"                 # Bourne-Again Shell, a UNIX command interpreter
brew "zsh"                  # Z shell, a UNIX command interpreter

#===================================================
# Core shell utilities
#===================================================
brew "gnupg"                # GNU Pretty Good Privacy (PGP) package
brew "neovim"               # Ambitious Vim-fork focused on extensibility and agility
brew "editorconfig"         # Maintain consistent coding style between multiple editors
brew "gettext"              # GNU internationalization (i18n) and localization (l10n) library
brew "less"                 # Pager program similar to more
brew "bat"                  # Clone of cat(1) with syntax highlighting and Git integration
brew "exa"                  # Modern replacement for 'ls'
brew "fd"                   # Simple, fast and user-friendly alternative to find
brew "ripgrep"              # Search tool like grep and The Silver Searcher
brew "jq"                   # Lightweight and flexible command-line JSON processor
brew "yq"                   # Process YAML documents from the CLI
brew "pstree"               # Show ps output as a tree
brew "rsync"                # Utility that provides fast incremental file transfer
brew "dog"                  # Command-line DNS clinent
brew "httpie"               # User-friendly cURL for API era
brew "wget"                 # Internet file retriever

#===================================================
# Source control
#===================================================
brew "git"                  # Distributed revision control system
brew "git-delta"            # Syntax highlighting pager for git and diff output
brew "git-flow"             # Extensions to follow Vincent Driessen's branching model
brew "git-lfs"              # Git extension for versioning large files

#===================================================
# Programming languages
#===================================================
brew "go"                   # Golang
brew "delve"                # Golang debugger
brew "kubebuilder"          # SDK for building Kubernetes APIs
brew "pyenv"                # Python version management
brew "pyenv-virtualenv"     # Pyenv plugin to manage virtualenv
brew "shellcheck"           # Static analysis and lint tool, for (ba)sh scripts
brew "yamllint"             # Linter for YAML files

#===================================================
# Virtualization
#===================================================
brew "ctop"                 # Top-like interface for container metrics
cask "docker"               # Build and share containerized applications

#===================================================
# Amazon Web Services
#===================================================
brew "awscli"               # Official Amazon AWS command-line interface
cask "aws-vault"            # Amazon AWS IAM password manager

#===================================================
# Kubernetes
#===================================================
brew "argocd"               # GitOps CI for Kubernetes
brew "kind"                 # Run a Kubernetes cluster in a Docker
brew "helm"                 # Kubernetes package manager
brew "kustomize"            # Customization of Kubernetes YAML manifests
brew "chart-testing"        # Testing and linting Helm charts
brew "kubernetes-cli"       # Kubernetes command-line interface
brew "krew"                 # Kubernetes package manager
brew "kubectx"              # Kubernetes context switching

#===================================================
# Infrastructure tools
#===================================================
brew "packer"               # Tool for creating identical machine images for multiple platforms
brew "vault"                # Secures, stores and tightly controls access to secrets
brew "terraform"            # Tool to build, change, and version infrastructure
brew "terragrunt"           # Tool to make Terraform configurations DRY

#===================================================
# Quick look plugins
#===================================================
cask "syntax-highlight"     # Renders source code with syntax highlighting
cask "qlcolorcode"          # Renders source code with syntax highlighting
cask "qlmarkdown"           # Renders markdown files
cask "qlstephen"            # Renders plain text files without extension
cask "quicklook-json"       # Renders json files

#===================================================
# Desktop applications
#===================================================
cask "1password"            # Password manager
cask "1password-cli"        # 1Password CLI
cask "adobe-acrobat-reader" # PDF reader
cask "bartender"            # Menu bar icon organizer
cask "cheatsheet"           # Tool to list all application shortcuts
cask "drawio"               # Free diagram software
cask "forklift"             # Finder replacement and FTP/S, WebDAV and AWS S3 client
cask "gitkraken"            # UI Git client focusing on productivity
cask "google-chrome"        # Web browser from Google
cask "iterm2"               # Better terminal emulator
cask "lens"                 # Kubernetes IDE
cask "macfuse"              # Integration with additional file systems
cask "postman"              # API development
cask "raycast"              # Control your tools with a few keystrokes
cask "microsoft-office"     # Microsoft office
cask "visual-studio-code"   # Open-source Code editor
